readme.org
#+TITLE:Dotfiles

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:nil todo:t |:t

#+author: Jason Cairns
#+email: jcai849@aucklanduni.ac.nz
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.1 (Org mode 9.2.3)

#+latex_class: article
#+LATEX_CLASS_OPTIONS: [a4paper, 11pt]
#+LATEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \usepackage{amsfonts}
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle:
#+date: \today

* Introduction
  The following is a description of my dotfiles, used for configuring
  the programs I use. Dotfiles composed by others have been made heavy
  use of. GNU Stow is used to manage the files; the =stow= file in this
  folder is a bash script that will automatically symlink all the
  dotfiles correctly in the home folder.
  #+begin_src bash :tangle stow_my_dotfiles
#!/usr/bin/env bash
stow X
stow stumpwm
stow bash
stow emacs
  #+end_src

* X
  X is the current windowing system for most GNU/Linux distributions,
  controlling how graphics are drawn on the screen. Important to keep in
  mind is the client/server structure of Xorg, as well as the age; there
  are mostly-deprecated systems that are kept around for dependency
  purposes. Usefully for our knowledge in customisation of fonts, is
  also of two systems: old server-based bitmapped /core/ fonts, and new
  client-based ttf /Xft/ fonts. [[https://en.wikibooks.org/wiki/Guide_to_X11/Fonts#Core_versus_Xft_fonts][X11 wikibook]] has further information.

** Xresources
   ~/.Xresources are like the CSS of the X system for all X applications. An
   application can be launched with the switch =-xrm "X resource"= to be
   modified directly. Useful resources include:
   https://stuff.mit.edu/afs/sipb/project/doc/ixresources/xres.html
   http://futurile.net/2016/06/14/xterm-setup-and-truetype-font-configuration/

*** Display
    Carloine's HiDPI monitor requires a manual dpi setting of 144; mine
    acts ok by default.
    #+begin_src conf :tangle ~/dotfiles/X/.Xresources
      Xft.dpi: 144
    #+end_src
*** Fonts
    The general fonts are set as the following:
    #+begin_src conf :tangle ~/dotfiles/X/.Xresources
      ,*faceName: Inconsolata
      ,*faceSize: 10
      ,*renderFont: true
      Xft.autohint: 0
      Xft.lcdfilter:  lcddefault
      Xft.hintstyle:  hintfull
      Xft.hinting: 1
      Xft.antialias: 1
      Xft.rgba: rgb
    #+end_src

*** Colours
    Colours are set according to the solarized colour scheme:
    #+begin_src conf :tangle ~/dotfiles/X/.Xresources
      #define S_base03        #002b36
      #define S_base02        #073642
      #define S_base01        #586e75
      #define S_base00        #657b83
      #define S_base0         #839496
      #define S_base1         #93a1a1
      #define S_base2         #eee8d5
      #define S_base3         #fdf6e3

      ,*background:            S_base03
      ,*foreground:            S_base0
      ,*fadeColor:             S_base03
      ,*cursorColor:           S_base1
      ,*pointerColorBackground:S_base01
      ,*pointerColorForeground:S_base1

      #define S_yellow        #b58900
      #define S_orange        #cb4b16
      #define S_red           #dc322f
      #define S_magenta       #d33682
      #define S_violet        #6c71c4
      #define S_blue          #268bd2
      #define S_cyan          #2aa198
      #define S_green         #859900

      !! black dark/light
      ,*color0:                S_base02
      ,*color8:                S_base03

      !! red dark/light
      ,*color1:                S_red
      ,*color9:                S_orange

      !! green dark/light
      ,*color2:                S_green
      ,*color10:               S_base01

      !! yellow dark/light
      ,*color3:                S_yellow
      ,*color11:               S_base00

      !! blue dark/light
      ,*color4:                S_blue
      ,*color12:               S_base0

      !! magenta dark/light
      ,*color5:                S_magenta
      ,*color13:               S_violet

      !! cyan dark/light
      ,*color6:                S_cyan
      ,*color14:               S_base1

      !! white dark/light
      ,*color7:                S_base2
      ,*color15:               S_base3
    #+end_src

*** Emacs-Specific
    Emacs-specific resources are set as:
    #+begin_src conf :tangle ~/dotfiles/X/.Xresources
      Emacs.font: Inconsolata-12
      Emacs.menuBar: off
      Emacs.verticalScrollBars: off
      Emacs.toolBar: off
      Emacs.fullscreen: maximized
    #+end_src

*** URxvt-Specific
    URxvt-specific resources are set as the following, taking heavy inspiration from https://www.askapache.com/linux/rxvt-xresources/
    #+begin_src conf :tangle ~/dotfiles/X/.Xresources
      URxvt.font: xft:Inconsolata:size=12
      URxvt.modifier: mod1
      URxvt*loginShell: true
      URxvt.borderless: true
      URxvt*dynamicColors: on
      URxvt*letterSpace: -1
      URxvt.geometry: WINDOWGEOMETRY
      URxvt.imLocale: en_US.UTF-8
      URxvt.lineSpace: 0
      URxvt.loginShell: true
      URxvt.saveLines: 5000
      URxvt.scrollBar: true
      URxvt.scrollstyle: plain
      URxvt*termName: xterm-256color
      URxvt.visualBell: false
      URxvt.fading: 15
      ! URxvt.urgentOnBell: true
      ! URxvt.urlLauncher: chrome
      ! URxvt.internalBorder: 3
      ! URxvt.depth: 24
      ! URxvt.letterSpace: -1
      ! URxvt.shading: 100
      ! URxvt.perl-ext-common:  default,tabbed,clipboard
      ! URxvt.tabbed.tabbar-fg: 4
      ! URxvt.tabbed.tabbar-bg: 0
      ! URxvt.tabbed.tab-fg:    9
      ! URxvt.tabbed.tab-bg:    0
      ! URxvt.keysym.M-c:   perl:clipboard:copy
      ! URxvt.keysym.M-v:   perl:clipboard:paste
    #+end_src

** xinitrc
   ~/.xinitrc is a bash script that defines how the X session is to be started. We want all programs to load asynchronously, hence the =&=
   #+begin_src bash :tangle ~/dotfiles/X/.xinitrc
     #!/bin/sh
     xrdb -merge ~/.Xresources	# ensure .Xresources loaded
     dunst &				# notifications
     xrandr &			  # window control
     autocutsel &			  # manage clipboard 
     ~/.local/bin/screenoff &

     eval $(/usr/bin/gnome-keyring-daemon --start --components=pkcs11,secrets,ssh) # gnome-keyring
     export SSH_AUTH_SOCK

     exec --no-startup-id nm-applet & # wifi
     exec emacs --daemon &		 # emacs server for client call
     xsetroot -cursor_name left_ptr & # better cursor
     exec /usr/bin/stumpwm		# wm
   #+end_src

** xsession
   =~/.xsession= is like =.xinitrc=, but xsession is started from
   /custom/ in a graphical display manager, while =.xinitrc= is started
   from =startx= utility, so a recommended way to always get =.xinitrc=
   is through setting =.xsession= to:
   #+begin_src bash :tangle ~/dotfiles/X/.xsession
     #!/bin/sh
     . ~/.profile
     . ~/.xinitrc
   #+end_src
   See https://unix.stackexchange.com/questions/281858/difference-between-xinitrc-xsession-and-xsessionrc for more details on the differences
* Emacs
  When Emacs is launched, it reads an init file (~/.emacs.d/init.el),
  which is configured using elisp, as the following:
** Package Management
   Packages are usually downloaded from an external repository, and
   use-package is a clean declarative tool to ensure package downloads,
   configure, and lazy-load them.
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (require 'package)
     (let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
			 (not (gnutls-available-p))))
	    (proto (if no-ssl "http" "https")))
       (when no-ssl
	 (warn "\
     Your version of Emacs does not support SSL connections,
     which is unsafe because it allows man-in-the-middle attacks.
     There are two things you can do about this warning:
     1. Install an Emacs version that does support SSL and be safe.
     2. Remove this warning from your init file so you won't see it again."))
       ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
       (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
       ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
       (when (< emacs-major-version 24)
	 ;; For important compatibility libraries like cl-lib
	 (add-to-list 'package-archives (cons "gnu" (concat proto "://elpa.gnu.org/packages/")))))
     (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
     (package-initialize)

     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
     (eval-when-compile
       (require 'use-package))
     (require 'use-package-ensure)
     (setq use-package-verbose t)
   #+end_src

   #+RESULTS:
   : t

** Keybindings
   Keybindings can be set using the following:
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   (global-set-key (kbd "<f5>") 'other-window)
   (global-set-key (kbd "C-`") 'linum-mode) ; toggle line numbers
   #+end_src
** Base Settings
   The following is a series of quality-of-life changes
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   (setq-default cursor-type 'bar)		; slim cursor
   (setq inhibit-startup-screen 1)		; no startup screen
   (setq initial-scratch-message nil)	; no startup scratch message
   (setq doc-view-continuous t)		; pull screen view along when cursor reaches edges
   (setq sentence-end-double-space nil)	; set sentence to end with single space
   (setq visible-bell nil			; remove annoying bell on C-g
	 ring-bell-function 'flash-mode-line) ;
   (defun flash-mode-line ()		   ; flash mode-line on C-g
     (invert-face 'mode-line)
     (run-with-timer 0.1 nil #'invert-face 'mode-line))
   (delete-selection-mode 1)		; delete over a selection region on insert
   (fset 'yes-or-no-p 'y-or-n-p)		; use "y/n" instead of "yes/no"
   (global-linum-mode 0)			; no line numbering
   (global-visual-line-mode 1)		; wrap text
   (setq fill-column 80)
   #+end_src
   Because these were defined in the Xresources, they aren't necessary here
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   ;; (add-to-list 'default-frame-alist '(fullscreen . fullboth)) ;fullscreen start
   ;; (add-to-list 'default-frame-alist '(fullscreen . maximized)) ;start fullscreen
   ;; (scroll-bar-mode -1)			; remove scroll bar
   ;; (tool-bar-mode -1)			; remove toolbar
   ;; (menu-bar-mode -1)			; remove menu bar
   #+end_src
*** TODO Backups
    https://stackoverflow.com/questions/151945/how-do-i-control-how-emacs-makes-backup-files
    #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
    (setq backup-directory-alist `(("." . "~/.saves")))
    (setq backup-by-copying t
	  delete-old-versions t
	  kept-new-versions 6
	  kept-old-versions 2
	  version-control t)
    (recentf-mode 0)

    #+end_src
** Appearance
*** Theme
    #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
      ;; (use-package zenburn-theme
      ;; 	:ensure t
      ;; 	:init (load-theme 'zenburn t))

      (use-package solarized-theme
      	:ensure t
      	:init (load-theme 'solarized-dark t)); or -light

      ;; (use-package leuven-theme
      ;; 	:ensure t
      ;; 	:init (load-theme 'leuven t))
    #+end_src
*** TODO Mode Line
    When I use a mode line, I use smart mode line. I haven't tried
    powerline yet.
    #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
      (use-package smart-mode-line
	:ensure t
	:init
	(sml/setup))
    #+end_src

    Show battery with display-battery-mode

    #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
      (display-battery-mode)
    #+end_src

    system information given with symon:
        #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
	  ;; (use-package symon
	  ;;   :ensure t
	  ;;   :init (setq symon-monitors
	  ;; 		'(symon-linux-memory-monitor
	  ;; 		  symon-linux-cpu-monitor
	  ;; 		  symon-linux-network-rx-monitor
	  ;; 		  symon-linux-network-tx-monitor
	  ;; 		  symon-linux-battery-monitor))
	  ;;   :hook ((after-init-hook) . symon-mode))
    #+end_src
