emacs/.emacs.d/init.el
(require 'package)
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
		    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))
  (when no-ssl
    (warn "\
Your version of Emacs does not support SSL connections,
which is unsafe because it allows man-in-the-middle attacks.
There are two things you can do about this warning:
1. Install an Emacs version that does support SSL and be safe.
2. Remove this warning from your init file so you won't see it again."))
  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives (cons "gnu" (concat proto "://elpa.gnu.org/packages/")))))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile
  (require 'use-package))
(require 'use-package-ensure)
(setq use-package-verbose t)

(global-set-key (kbd "<f5>") 'other-window)
(global-set-key (kbd "C-`") 'linum-mode) ; toggle line numbers

(setq-default cursor-type 'bar)		; slim cursor
(setq inhibit-startup-screen 1)		; no startup screen
(setq initial-scratch-message nil)	; no startup scratch message
(setq doc-view-continuous t)		; pull screen view along when cursor reaches edges
(setq sentence-end-double-space nil)	; set sentence to end with single space
(setq visible-bell nil			; remove annoying bell on C-g
      ring-bell-function 'flash-mode-line) ;
(defun flash-mode-line ()		   ; flash mode-line on C-g
  (invert-face 'mode-line)
  (run-with-timer 0.1 nil #'invert-face 'mode-line))
(delete-selection-mode 1)		; delete over a selection region on insert
(fset 'yes-or-no-p 'y-or-n-p)		; use "y/n" instead of "yes/no"
(global-linum-mode 0)			; no line numbering
(global-visual-line-mode 1)		; wrap text
(setq fill-column 80)

;; (add-to-list 'default-frame-alist '(fullscreen . fullboth)) ;fullscreen start
;; (add-to-list 'default-frame-alist '(fullscreen . maximized)) ;start fullscreen
;; (scroll-bar-mode -1)			; remove scroll bar
;; (tool-bar-mode -1)			; remove toolbar
;; (menu-bar-mode -1)			; remove menu bar

(setq backup-directory-alist `(("." . "~/.saves")))
(setq backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
(recentf-mode 0)

;; (use-package zenburn-theme
;; 	:ensure t
;; 	:init (load-theme 'zenburn t))

(use-package solarized-theme
  :ensure t
  :init (load-theme 'solarized-dark t)); or -light

;; (use-package leuven-theme
;; 	:ensure t
;; 	:init (load-theme 'leuven t))

(use-package smart-mode-line
  :ensure t
  :init
  (sml/setup))

(display-battery-mode)

;; (use-package symon
;;   :ensure t
;;   :init (setq symon-monitors
;; 		'(symon-linux-memory-monitor
;; 		  symon-linux-cpu-monitor
;; 		  symon-linux-network-rx-monitor
;; 		  symon-linux-network-tx-monitor
;; 		  symon-linux-battery-monitor))
;;   :hook ((after-init-hook) . symon-mode))
