readme.org
** Editing
   Smartparens helps with parentheses. Paredit and Paredit's successors
   are probabily better, but I'll update this once I make more use of
   lisp
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  ;; (use-package smartparens
  ;;   :hook ((prog-mode text-mode) . smartparens-mode))
   #+end_src
   Company provides autocomplete for various packages
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package company
       :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode))
   #+end_src
   Rainbow delimiters colours parentheses
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package rainbow-delimiters
       :ensure t
     :hook ((prog-mode) . rainbow-delimiters-mode))
   #+end_src
   Flycheck provides syntax highlighting
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))
   #+end_src
   Yasnippet allows for the insertion of templates
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package yasnippet
  :ensure t
  :init
  (add-to-list 'load-path
	       "~/.emacs.d/plugins/yasnippet")
  (require 'yasnippet)
  (yas-global-mode 1))
   #+end_src
   re-builder is an internal package that allows for testing of regular
   expressions
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (require 're-builder)
  (setq reb-re-syntax 'string)
   #+end_src
** Navigation
   Paredit:
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (use-package paredit
    :ensure t
    :init
    (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
    (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
    (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
    (add-hook 'slime-repl-mode-hook (lambda () (paredit-mode +1))))
   #+end_src
   which-key displays which key is next on the tree
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (use-package which-key
    :ensure t
    :init
    (which-key-mode 1))
   #+end_src
   helm is an "incremental completion and selection narrowing
   framework" - in the same niche as ivy, consel, and swiper, which I
   intend to test out and potentially replace.
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   ;; (use-package helm
   ;;   :init
   ;;   (helm-mode t)
   ;;   :bind
   ;;   (("M-x" . helm-M-x)
   ;;    ("C-x r b" . helm-filtered-bookmarks)
   ;;    ("C-x C-f" . helm-find-files))
   ;;   ;; :init
   ;;   ;; (helm-mode 1)
   ;;   :custom
   ;;   (helm-mode-fuzzy-match t)
   ;;   (helm-completion-in-region-fuzzy-match t))
   #+end_src
Ace-Window helps in the selection of windows - trialling this before potentially switching to exwm
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     ;; (use-package ace-window
     ;;   :bind ("M-o" . ace-window)
     ;;   :config (setq aw-dispatch-always t))
#+end_src
   Here is a setup for Ivy+Counsel+Swiper
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package ivy
       :ensure t
     :demand
     :bind ("C-c C-r" . ivy-resume)
     :config
     (setq magit-completing-read-function 'ivy-completing-read)
     (setq projectile-completion-system 'ivy)
     (setq ivy-use-virtual-buffers nil
	   ivy-count-format "%d/%d "))

   (ivy-mode 1)

   (use-package swiper
     :ensure t
     :config (setq search-default-mode #'char-fold-to-regexp)
     :bind ("C-s" . swiper))

   (use-package counsel
     :ensure t
     :bind (("M-x" . counsel-M-x)
	    ("C-x C-f" . counsel-find-file)
	    ("<f1> f" . counsel-describe-function)
	    ("<f1> v" . counsel-describe-variable)
	    ("<f1> l" . counsel-find-library)
	    ("<f2> i" . counsel-info-lookup-symbol)
	    ("<f2> u" . counsel-unicode-char)
	    ("C-c g" . counsel-git)
	    ("C-c j" . counsel-git-grep)
	    ("C-c k" . counsel-ag)
	    ("C-x l" . counsel-locate)
	    ("C-S-o" . counsel-rhythmbox)
	    ("C-r" . counsel-minibuffer-history)))
   #+end_src
Pdf-tools is a better replacement to docView for pdf, djvu etc. files.
It does so through the "pdf-view" major mode. An interesting ability
is the minor mode, "pdf-view-midnight-minor-mode", bound to C-c C-r m.
Following code for pdf-tools taken from [[http://pragmaticemacs.com/emacs/view-and-annotate-pdfs-in-emacs-with-pdf-tools/][Pragmatic Emacs]]. Compatibility ensured with org-pdfview, code taken from 
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package pdf-tools
       :pin manual ;; manually update
       :config
       ;; initialise
       (pdf-tools-install)
       ;; open pdfs scaled to fit page
       (setq-default pdf-view-display-size 'fit-page)
       ;; automatically annotate highlights
       (setq pdf-annot-activate-created-annotations t)
       ;; use normal isearch
       (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))

     ;; (use-package org-pdfview
     ;;   :ensure t
     ;;   :config
     ;;   (eval-after-load 'org '(require 'org-pdfview))
     ;;   (add-to-list 'org-file-apps 
     ;; 		    '("\\.pdf\\'" . (lambda (file link)
     ;; 				      (org-pdfview-open link)))))
   #+end_src

Dired-x is an inbuilt extension to dired

   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
(add-hook 'dired-load-hook
          (lambda ()
            (load "dired-x")))
   #+end_src

** Project Management
   Projectile gives commands and infor for navigating projects. A lot
   more to it than I currently have tested
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  ;; (use-package projectile)
  ;; (projectile-mode +1)
  ;; (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  ;; (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  ;; (setq projectile-project-search-path '("~/"))
   #+end_src
** Cryptography
   I use pass, which uses password-store.el to interface to emacs
   #+begin_src bash
# cd ~/.emacs.d/elisp
# wget https://git.zx2c4.com/password-store/plain/contrib/emacs/password-store.el
   #+end_src
   Which is then loaded using:
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   ;; (load "~/.emacs.d/elisp/password-store")
   #+end_src
   Then pass is used as a major mode along with ivy-pass
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   ;; (use-package pass
   ;;   :ensure t)

   ;; (use-package ivy-pass
   ;;   :ensure t)
   #+end_src
** Git
   Magit is an exteremely well-made interface ("porcelain") to git.
   see
   https://github.com/magit/magit/wiki/Pinning-Magit-to-Melpa-Stable,
   was having issues with transient commands being invoked from commit
   message text.
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/")
             t)
     (add-to-list 'package-pinned-packages '(magit . "melpa-stable"))

     (add-to-list 'package-pinned-packages '(ghub . "melpa-stable"))
(add-to-list 'package-pinned-packages '(git-commit . "melpa-stable"))
(add-to-list 'package-pinned-packages '(magit-popup . "melpa-stable"))
     (add-to-list 'package-pinned-packages '(with-editor . "melpa-stable"))
     
   #+end_src
** Python
   The primary mode for python is elpy
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (use-package elpy
    :ensure t
    :defer t
    :init
    (advice-add 'python-mode :before 'elpy-enable)
    (setq elpy-rpc-virtualenv-path 'current))
   #+end_src
   We set everything to work with python3
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
   (setq flycheck-python-pycompile-executable "python3"
	 flycheck-python-pylint-executable "python3"
	 flycheck-python-flake8-executable "python3")
   (setq python-shell-interpreter "python3"
	 python-shell-interpreter-args "-i")
   (setq org-babel-python-command "python3")
   ;; (python-shell-completion-native-disabled-interpreters (quote ("python3")))
   #+end_src
   Using pep8 as the standard
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package py-autopep8
       :ensure t
       :init
       (add-hook 'python-mode-hook 'py-autopep8-enable-on-save))
     #+end_src
   Allowing the creation of pyenv environments
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  ;; (use-package pyenv-mode)		;M-x pyvenv-activate
   #+end_src
** R
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package ess
       :init (require 'ess-rutils))
   #+end_src
** Lisp
   Setting up slime to work with common lisp
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
    (use-package slime)
   ;; (setq inferior-lisp-program "sbcl")
   ;;   (slime-setup '(slime-company))
   ;;   (load (expand-file-name "~/quicklisp/slime-helper.el"))
   #+end_src
   Let's try add support for scheme in slime:
#+begin_src bash
curl https://raw.githubusercontent.com/emacsmirror/slime/master/contrib/swank-mit-scheme.scm > ~/.emacs.d/swank-mit-scheme.scm
  #+end_src

   Geiser supports scheme programming. Not as good as slime, but does
   the job.

   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package geiser
       :ensure t
       :config
       (setq geiser-default-implementation 'mit)
       (setq geiser-active-implementations '(mit))
       :hook ((scheme-mode-hook) . geiser-mode))
   #+end_src
** Markup
