emacs/.emacs.d/init.el

;; (use-package smartparens
;;   :hook ((prog-mode text-mode) . smartparens-mode))

(use-package company
   :ensure t
:init
(add-hook 'after-init-hook 'global-company-mode))

(use-package rainbow-delimiters
  :ensure t
:hook ((prog-mode) . rainbow-delimiters-mode))

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))

(use-package yasnippet
:ensure t
:init
(add-to-list 'load-path
	     "~/.emacs.d/plugins/yasnippet")
(require 'yasnippet)
(yas-global-mode 1))

(require 're-builder)
(setq reb-re-syntax 'string)

(use-package paredit
  :ensure t
  :init
  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
  (add-hook 'slime-repl-mode-hook (lambda () (paredit-mode +1))))

(use-package which-key
  :ensure t
  :init
  (which-key-mode 1))

;; (use-package helm
;;   :init
;;   (helm-mode t)
;;   :bind
;;   (("M-x" . helm-M-x)
;;    ("C-x r b" . helm-filtered-bookmarks)
;;    ("C-x C-f" . helm-find-files))
;;   ;; :init
;;   ;; (helm-mode 1)
;;   :custom
;;   (helm-mode-fuzzy-match t)
;;   (helm-completion-in-region-fuzzy-match t))

;; (use-package ace-window
;;   :bind ("M-o" . ace-window)
;;   :config (setq aw-dispatch-always t))

(use-package ivy
    :ensure t
  :demand
  :bind ("C-c C-r" . ivy-resume)
  :config
  (setq magit-completing-read-function 'ivy-completing-read)
  (setq projectile-completion-system 'ivy)
  (setq ivy-use-virtual-buffers nil
	ivy-count-format "%d/%d "))

(ivy-mode 1)

(use-package swiper
  :ensure t
  :config (setq search-default-mode #'char-fold-to-regexp)
  :bind ("C-s" . swiper))

(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file)
	 ("<f1> f" . counsel-describe-function)
	 ("<f1> v" . counsel-describe-variable)
	 ("<f1> l" . counsel-find-library)
	 ("<f2> i" . counsel-info-lookup-symbol)
	 ("<f2> u" . counsel-unicode-char)
	 ("C-c g" . counsel-git)
	 ("C-c j" . counsel-git-grep)
	 ("C-c k" . counsel-ag)
	 ("C-x l" . counsel-locate)
	 ("C-S-o" . counsel-rhythmbox)
	 ("C-r" . counsel-minibuffer-history)))

(use-package pdf-tools
  :pin manual ;; manually update
  :config
  ;; initialise
  (pdf-tools-install)
  ;; open pdfs scaled to fit page
  (setq-default pdf-view-display-size 'fit-page)
  ;; automatically annotate highlights
  (setq pdf-annot-activate-created-annotations t)
  ;; use normal isearch
  (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))

;; (use-package org-pdfview
;;   :ensure t
;;   :config
;;   (eval-after-load 'org '(require 'org-pdfview))
;;   (add-to-list 'org-file-apps 
;; 		    '("\\.pdf\\'" . (lambda (file link)
;; 				      (org-pdfview-open link)))))

(add-hook 'dired-load-hook
          (lambda ()
            (load "dired-x")))

;; (use-package projectile)
;; (projectile-mode +1)
;; (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
;; (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
;; (setq projectile-project-search-path '("~/"))

;; (load "~/.emacs.d/elisp/password-store")

;; (use-package pass
;;   :ensure t)

;; (use-package ivy-pass
;;   :ensure t)

(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/")
             t)
     (add-to-list 'package-pinned-packages '(magit . "melpa-stable"))

     (add-to-list 'package-pinned-packages '(ghub . "melpa-stable"))
(add-to-list 'package-pinned-packages '(git-commit . "melpa-stable"))
(add-to-list 'package-pinned-packages '(magit-popup . "melpa-stable"))
     (add-to-list 'package-pinned-packages '(with-editor . "melpa-stable"))

(use-package elpy
  :ensure t
  :defer t
  :init
  (advice-add 'python-mode :before 'elpy-enable)
  (setq elpy-rpc-virtualenv-path 'current))

(setq flycheck-python-pycompile-executable "python3"
      flycheck-python-pylint-executable "python3"
      flycheck-python-flake8-executable "python3")
(setq python-shell-interpreter "python3"
      python-shell-interpreter-args "-i")
(setq org-babel-python-command "python3")
;; (python-shell-completion-native-disabled-interpreters (quote ("python3")))

(use-package py-autopep8
  :ensure t
  :init
  (add-hook 'python-mode-hook 'py-autopep8-enable-on-save))

;; (use-package pyenv-mode)		;M-x pyvenv-activate

(use-package ess
  :init (require 'ess-rutils))

(use-package slime)
;; (setq inferior-lisp-program "sbcl")
;;   (slime-setup '(slime-company))
;;   (load (expand-file-name "~/quicklisp/slime-helper.el"))

(use-package geiser
  :ensure t
  :config
  (setq geiser-default-implementation 'mit)
  (setq geiser-active-implementations '(mit))
  :hook ((scheme-mode-hook) . geiser-mode))
