readme.org
*** LaTeX
    *IMPORTANT*: use-package requires the return of a package name,
    and auctex doesn't necessarily work like that, so auctex needs to
    be installed directly, if not already installed

   Latex export https://stackoverflow.com/questions/3300497/using-minted-source-code-latex-package-with-emacs-auctex
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (eval-after-load "tex" 
      '(setcdr (assoc "LaTeX" TeX-command-list)
	       '("%`%l%(mode) -shell-escape%' %t"
		 TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX")))
   #+end_src

   Get AucTeX to use pdf-tools as the pdf viewer
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
	   TeX-source-correlate-start-server t)
   #+end_src

   From [[https://tex.stackexchange.com/questions/154751/biblatex-with-biber-configuring-my-editor-to-avoid-undefined-citations/154753#154753][SO: biblatex AuCTex]]:
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (setq tex-bibtex-command "biber")
     (setq TeX-parse-self t)
   #+end_src
**** Bibliography
reftex: for management of bib files. Doesn't work too well with
biblatex. Whatever fixed
https://tex.stackexchange.com/questions/54739/reftex-wont-find-my-bib-file-in-local-library-tree
doesn't work for me
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (add-hook 'LaTeX-mode-hook 'turn-on-reftex)   ; with AUCTeX LaTeX mode
     (add-hook 'latex-mode-hook 'turn-on-reftex)   ; with Emacs latex mode
     (setq reftex-plug-into-AUCTeX t)
     ;; So that RefTeX also recognizes \addbibresource. Note that you
     ;; can't use $HOME in path for \addbibresource but that "~"
     ;; works.
     (setq reftex-bibliography-commands '("bibliography" "nobibliography" "addbibresource"))
     (eval-after-load 'reftex-vars
  '(progn
     ;; (also some other reftex-related customizations)
     (setq reftex-cite-format
           '((?\C-m . "\\cite[]{%l}")
             (?f . "\\footcite[][]{%l}")
             (?t . "\\textcite[]{%l}")
             (?p . "\\parencite[]{%l}")
             (?o . "\\citepr[]{%l}")
             (?n . "\\nocite{%l}")))))
   #+end_src
   Bibtex should be as biblatex:
#+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (setq bibtex-dialect 'biblatex)
   #+end_src  
   for navigation of bib files:
#+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  (use-package ivy-bibtex
    :ensure t)
   #+end_src   
ebib is an alternative to reftex, works ok but the keybindings are a
lot to remember.
#+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  ;; (use-package ebib
  ;;   :ensure t
  ;;   :bind (("C-c C-e" . ebib)
  ;; 	   ("C-c b" . ebib-insert-citation))
  ;;   :config
  ;;   (setq ebib-bibtex-dialect "biblatex")
  ;;   (setq ebib-layout 'custom))
   #+end_src   
*** Org
    Org is an extremely powerful markup specification, with org agenda and
    org babel being two especially useful features
**** Initialisation
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
       (use-package org
	 ;; :bind
	 ;; (("\C-cl" . org-store-link)
	 ;;  ("\C-ca" . org-agenda)
	 ;;  ("\C-cc" . org-capture)
	 ;;  ("\C-cb" . org-switchb))
	 :config
	 (unless (string-match-p "\\.gpg" org-agenda-file-regexp)
	 (setq org-agenda-file-regexp
	       (replace-regexp-in-string "\\\\\\.org" "\\\\.org\\\\(\\\\.gpg\\\\)?"
					 org-agenda-file-regexp))) ;https://emacs.stackexchange.com/questions/36542/include-org-gpg-files-in-org-agenda
	 (org-babel-do-load-languages
	  'org-babel-load-languages
	  '((lisp . t)
	    (R . t)
	    (latex . t)
	    (python . t)
	    (shell . t)
	    (scheme . t)))
	 (setq org-confirm-babel-evaluate nil)
	 (add-to-list 'org-structure-template-alist
		      '("r" . "src R :results output :colnames yes :hline yes :session rsession1 :tangle yes :comments link :exports both :eval never-export"))
	 (add-to-list 'org-structure-template-alist
		      '("g" . "src R :file chart.png :res 100 :height 400 :width 600 :results output graphics :colnames yes :session rsession1 :exports both :eval never-export"))
	 (add-to-list 'org-structure-template-alist
		      '("p" . "src python :results output :colnames yes :session pysession1 :tangle yes :comments link :exports both :eval never-export"))
	 :custom
	 (org-list-allow-alphabetical t)
	 (org-modules
	  (quote
	   (org-bbdb org-bibtex org-docview org-gnus org-habit org-info org-irc org-mhe org-rmail org-w3m org-drill org-eval org-learn)))
	 (org-todo-keywords (quote ((sequence "TODO" "WAITING" "|" "CLOSED"))))
	 (org-drill-cram-hours 0)
	 (org-log-done 'time)
	 (org-link-file-path-type "relative")
	 (org-todo-keywords '((sequence "TODO" "WAITING" "|" "CLOSED")))
	 (org-agenda-time-grid
	  (quote
	   ((daily weekly today)
	    (800 1000 1200 1400 1600 1800 2000)
	    "......" "----------------"))))

       (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
       (add-hook 'org-mode-hook 'org-display-inline-images)
       (if (require 'toc-org nil t)
       (add-hook 'org-mode-hook 'toc-org-mode)
       (warn "toc-org not found"))
     #+end_src
**** Export
     I use minted as the latex syntax highlighting engine.
     Additionally, org toc is useful for the creation of a table of
     contents especially when exporting to github.

     Pandoc Mode allows for conversion of documents, useful primarily
     for org mode
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (setq org-latex-minted-options '(("frame" "lines")
				      ("fontsize" "\\scriptsize")
				      ("xleftmargin" "\\parindent")
				      ("linenos" "")))
     (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
     ;; (require 'ox-latex)
     ;; (setq org-latex-listings (quote minted))

     ;; (use-package toc-org
     ;; :ensure t)

     ;; (use-package pandoc-mode
     ;; :ensure t)

     ;; (use-package ox-pandoc
     ;; :ensure t)
     #+end_src
**** Agenda
 The agenda files are those read in for the agenda:
     I first used org-super-agenda, but I think I ought to have learnt how
     to work with the base agenda first - to do
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
       ;; (use-package org-super-agenda)

       ;; (setq org-agenda-skip-scheduled-if-done t
       ;; 	     org-agenda-skip-deadline-if-done t
       ;; 	     org-agenda-include-deadlines t
       ;; 	     org-agenda-include-diary nil
       ;; 	     org-agenda-block-separator nil
       ;; 	     org-agenda-compact-blocks t
       ;; 	     org-agenda-start-with-log-mode t
       ;; 	     org-agenda-start-on-weekday 1
       ;; 	     org-deadline-warning-days 30)

       ;; (setq org-agenda-custom-commands
       ;; 	     '(("v" "week-overview"
       ;; 		((agenda ""
       ;; 			 ((org-super-agenda-groups
       ;; 			   '((:discard (:tag ("drill")
       ;; 					     :regexp "CLOSED")
       ;; 				       :order 0)
       ;; 			     (:name "Residual Tasks"
       ;; 				    :scheduled past
       ;; 				    :deadline past
       ;; 				    :order 2
       ;; 				    )
       ;; 			     (:name "Schedule"
       ;; 				    :time-grid t
       ;; 				    :order 3)
       ;; 			     (:name "Current Tasks"
       ;; 				    :scheduled today
       ;; 				    :order 4)
       ;; 			     (:name "Waiting"
       ;; 				    :todo "WAITING"
       ;; 				    :order 5)
       ;; 			     (:name "Unscheduled Future Deadlines"
       ;; 				    :and (:not (:scheduled future)
       ;; 					       :deadline future)
       ;; 				    :order 6)
       ;; 			     (:name "Future Tasks"
       ;; 				    :deadline t
       ;; 				    :scheduled t
       ;; 				    :order 7)))))
       ;; 		 (todo "WAITING" ((org-agenda-overriding-header "Waiting")
       ;; 				  (org-agenda-todo-ignore-with-date 1)))
       ;; 		 (todo "TODO"
       ;; 		       ((org-agenda-overriding-header "")
       ;; 			(org-agenda-todo-ignore-with-date 1)
       ;; 			(org-super-agenda-groups
       ;; 			 '((:name "Reserve Tasks"
       ;; 				  :tag ("reserve")
       ;; 				  :order 1)
       ;; 			   (:name "Unscheduled Tasks"
       ;; 				  :anything t
       ;; 				  :order 0)))))))))

     #+end_src
**** Misc.
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq package-check-signature nil)
     #+end_src
**** calfw
 Creates a calendar, integrates well with org
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
       ;; (use-package calfw
       ;; 	 :ensure t)
       ;; (use-package calfw-org
       ;; 	 :ensure t)
     #+end_src
 use M-x cfw:open-org-calendar to open org calendar
