readme.org
**** ref
     Org-ref doesn't work too well with biblatex. I will instead use
     auctex and reftex, as well as ebib when I need something higher-level.
     #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
       ;; (use-package org-ref
       ;; 	 :ensure t
       ;; 	 :config
       ;; 	 (require 'org-id)
       ;; 	 (require 'org-ref-wos)
       ;; 	 (require 'org-ref-scopus)
       ;; 	 (require 'org-ref-pubmed)
       ;; 	 (require 'doi-utils)
       ;; 	 (setq bibtex-autokey-year-length 4
       ;; 	 bibtex-autokey-name-year-separator "-"
       ;; 	 bibtex-autokey-year-title-separator "-"
       ;; 	 bibtex-autokey-titleword-separator "-"
       ;; 	 bibtex-autokey-titlewords 2
       ;; 	 bibtex-autokey-titlewords-stretch 1
       ;; 	 bibtex-autokey-titleword-length 5)
       ;; 	 (setq org-export-with-broken-links t)
       ;; 	 ;; (setq org-latex-pdf-process
       ;; 	 ;;       '("pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
       ;; 	 ;; 	"bibtex %b"
       ;; 	 ;; 	"makeindex %b"
       ;; 	 ;; 	"pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
       ;; 	 ;; 	"pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"))
       ;; 	 (setq  org-latex-pdf-process
       ;; 	'("latexmk -shell-escape -bibtex -pdf %f"))
       ;; 	 (setq org-ref-completion-library 'org-ref-ivy-cite))
     #+end_src
*** Misc
   Markdown
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package markdown-mode
       :defer t)
   #+end_src

   Polymode for the unfortunate times using R Markdown instead of org
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package polymode
       :ensure t)

     (use-package poly-R
       :ensure t)

     (use-package poly-markdown
       :ensure t)

     (use-package poly-org
       :ensure t)
   #+end_src
** Misc
   Yet to play with ledger
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
  ;; (use-package ledger-mode
  ;;   :defer t)
   #+end_src

   Very nice to have consistency in REPL - would be nice if geiser
   worked with MIT scheme - keeps opening up a new session every time
   at the moment. Note: fixed. Must push PR. 
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package eval-in-repl
       :ensure t
       :init
       (require 'eval-in-repl-ielm)
       (define-key emacs-lisp-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
       ;; for *scratch*
       (define-key lisp-interaction-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
       ;; for M-x info
       (define-key Info-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
       ;;; Geiser support (for Racket and Guile Scheme)
       ;; When using this, turn off racket-mode and scheme supports
       ;; (require 'geiser) ; if not done elsewhere
       (add-hook 'geiser-mode-hook
       		  '(lambda ()
       		     (local-set-key (kbd "<C-return>") 'eir-eval-in-geiser)))

       ;; (require 'scheme)    ; if not done elsewhere
       ;; (require 'cmuscheme) ; if not done elsewhere
       ;; (require 'eval-in-repl-scheme)
       ;; (add-hook 'scheme-mode-hook
       ;; 		 '(lambda ()
       ;; 		    (local-set-key (kbd "<C-return>") 'eir-eval-in-scheme)))
       
       ;; shell support
       (require 'eval-in-repl-shell)
       (add-hook 'sh-mode-hook
		 '(lambda()
		    (local-set-key (kbd "C-<return>") 'eir-eval-in-shell))))
   #+end_src
** MIX
The [[https://www.gnu.org/software/mdk/manual/mdk.html][MIX Development Kit]] provides a set of tools to use MIX from TAOCP.
The kit needs to be downloaded then installed, then the .el file
sourced for emacs support.
   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     ;; (setq load-path (cons "/usr/local/share/mdk" load-path))
     ;; (autoload 'mixal-mode "mixal-mode" t)
     ;; (add-to-list 'auto-mode-alist '("\\.mixal\\'" . mixal-mode))
     ;; (autoload 'mixvm "mixvm" "mixvm/gud interaction" t)
   #+end_src

** J
Interesting language to try out, especially for linear algebra and
graphics

   #+begin_src elisp :tangle ~/dotfiles/emacs/.emacs.d/init.el
     (use-package j-mode
       :ensure t
       :init
       (local-set-key (kbd "C-c !") 'j-console)
       (local-set-key (kbd "C-<return>") 'j-console-execute-line)
       (custom-set-faces
	'(j-verb-face ((t (:foreground "Red"))))
	'(j-adverb-face ((t (:foreground "Green"))))
	'(j-conjunction-face ((t (:foreground "Blue"))))
	'(j-other-face ((t (:foreground "Black"))))))
   #+end_src

* Bash
** Scripts
   [[https://wiki.archlinux.org/index.php/HiDPI#X_Resources][Arch Wiki]] gives some idea about how to configure X Resources such that
   dpi is set properly; this may be worth implementing with a script
*** Connect-Screen-Off
    To turn off the laptop screen when connected to an external (HDMI) monitor:
    #+begin_src bash :shebang "#!/usr/bin/env bash" :tangle ~/dotfiles/bash/.local/bin/screenoff
      EXTERNAL_OUTPUT="HDMI-1"
      INTERNAL_OUTPUT="eDP-1"

      xrandr |grep $EXTERNAL_OUTPUT | grep " connected "
      if [ $? -eq 0 ]; then
	  xrandr --output $INTERNAL_OUTPUT --off
      fi
    #+end_src
** .bashrc
The bashrc contains the initial settings for bash.
*** Original
The following is a clone of what I initially found there (don't want
to break anything)
#+begin_src bash :tangle ~/dotfiles/bash/.bashrc
# ~/.bashrc: executed by bash(1) for non-login shells.
# see /usr/share/doc/bash/examples/startup-files (in the package bash-doc)
# for examples

# If not running interactively, don't do anything
case $- in
    *i*) ;;
      *) return;;
esac

# don't put duplicate lines or lines starting with space in the history.
# See bash(1) for more options
HISTCONTROL=ignoreboth

# append to the history file, don't overwrite it
shopt -s histappend

# for setting history length see HISTSIZE and HISTFILESIZE in bash(1)
HISTSIZE=1000
HISTFILESIZE=2000

# check the window size after each command and, if necessary,
# update the values of LINES and COLUMNS.
shopt -s checkwinsize

# If set, the pattern "**" used in a pathname expansion context will
# match all files and zero or more directories and subdirectories.
#shopt -s globstar

# make less more friendly for non-text input files, see lesspipe(1)
#[ -x /usr/bin/lesspipe ] && eval "$(SHELL=/bin/sh lesspipe)"

# set variable identifying the chroot you work in (used in the prompt below)
if [ -z "${debian_chroot:-}" ] && [ -r /etc/debian_chroot ]; then
    debian_chroot=$(cat /etc/debian_chroot)
fi

# set a fancy prompt (non-color, unless we know we "want" color)
case "$TERM" in
    xterm-color|*-256color) color_prompt=yes;;
esac

# uncomment for a colored prompt, if the terminal has the capability; turned
# off by default to not distract the user: the focus in a terminal window
# should be on the output of commands, not on the prompt
#force_color_prompt=yes

if [ -n "$force_color_prompt" ]; then
    if [ -x /usr/bin/tput ] && tput setaf 1 >&/dev/null; then
	# We have color support; assume it's compliant with Ecma-48
	# (ISO/IEC-6429). (Lack of such support is extremely rare, and such
	# a case would tend to support setf rather than setaf.)
	color_prompt=yes
    else
	color_prompt=
    fi
fi

if [ "$color_prompt" = yes ]; then
    PS1='${debian_chroot:+($debian_chroot)}\[\033[01;32m\]\u@\h\[\033[00m\]:\[\033[01;34m\]\w\[\033[00m\]\$ '
else
    PS1='${debian_chroot:+($debian_chroot)}\u@\h:\w\$ '
fi
unset color_prompt force_color_prompt

# If this is an xterm set the title to user@host:dir
case "$TERM" in
xterm*|rxvt*)
    PS1="\[\e]0;${debian_chroot:+($debian_chroot)}\u@\h: \w\a\]$PS1"
    ;;
*)
    ;;
esac

# enable color support of ls and also add handy aliases
if [ -x /usr/bin/dircolors ]; then
    test -r ~/.dircolors && eval "$(dircolors -b ~/.dircolors)" || eval "$(dircolors -b)"
    alias ls='ls --color=auto'
    #alias dir='dir --color=auto'
    #alias vdir='vdir --color=auto'

    #alias grep='grep --color=auto'
    #alias fgrep='fgrep --color=auto'
    #alias egrep='egrep --color=auto'
fi

# colored GCC warnings and errors
#export GCC_COLORS='error=01;31:warning=01;35:note=01;36:caret=01;32:locus=01:quote=01'

# some more ls aliases
#alias ll='ls -l'
#alias la='ls -A'
#alias l='ls -CF'

# Alias definitions.
# You may want to put all your additions into a separate file like
# ~/.bash_aliases, instead of adding them here directly.
# See /usr/share/doc/bash-doc/examples in the bash-doc package.

if [ -f ~/.bash_aliases ]; then
    . ~/.bash_aliases
fi

# enable programmable completion features (you don't need to enable
# this, if it's already enabled in /etc/bash.bashrc and /etc/profile
# sources /etc/bash.bashrc).
if ! shopt -oq posix; then
  if [ -f /usr/share/bash-completion/bash_completion ]; then
    . /usr/share/bash-completion/bash_completion
  elif [ -f /etc/bash_completion ]; then
    . /etc/bash_completion
  fi
fi

export EDITOR=vim # emacsclient
#+end_src
*** Environmental Variables
#+begin_src bash :tangle ~/dotfiles/bash/.bashrc
  PDFVIEWER_texdoc=zathura
#+end_src
*** Aliases
#+begin_src bash :tangle ~/dotfiles/bash/.bashrc
  alias bm='bashmount'
  alias upw="pass show --clip 'Public/University of Auckland'"
#+end_src
*** PATH
#+begin_src bash :tangle ~/dotfiles/bash/.bashrc
  export PATH="/home/user/.local/bin:$PATH"
  # export PATH="/home/user/.config/guix/current/bin${PATH:+:}$PATH"
  # export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale"
#+end_src
* Stumpwm
  Using Stumpwm as the window manager.
** General
   some general configurations, borrowing heavily from
   https://github.com/benjamin-james/dotfiles/blob/master/.stumpwmrc:
   #+begin_src lisp :tangle ~/dotfiles/stumpwm/.stumpwmrc
     (in-package :stumpwm)

     (setq *startup-message* "Welcome back, Jason")

     ;; (global "XF86MonBrightnessUp" "increase-brightness")
     ;; (global "XF86MonBrightnessDown" "decrease-brightness")
     ;; (global "XF86AudioRaiseVolume" "increase-volume")
     ;; (global "XF86AudioLowerVolume" "decrease-volume")
     ;; (global "XF86AudioMute" "mute")
     ;; (global "XF86AudioNext" "next-song")
     ;; (global "XF86AudioPrev" "prev-song")
     ;; (global "XF86AudioStop" "stop-song")
     ;; (global "XF86AudioPlay" "play-song")
     ;; (global "Print" "screenshot")

     (setf *mouse-focus-policy* :click) 
     (setf *window-border-style* :thin) ;; :none :thick :thin :tight -- no borders

     ;; Message window

     ;;;; Message window gravity
     ;; ; :top-left :top-right :bottom-left :bottom-right :center
     (setq *message-window-gravity* :center)

     ;;;; Input window gravity
     ;; ; :top-left :top-right :bottom-left :bottom-right :center
     (setq *input-window-gravity* :center)

     ;; (set-win-bg-color "#222")
     ;; (set-focus-color "yellow")
     ;; (set-unfocus-color "#222")
   #+end_src
** Base Keybindings
   The keybindings (borrowing from
   https://github.com/kostafey/dotfiles/blob/master/.stumpwmrc)
   #+begin_src lisp :tangle ~/dotfiles/stumpwm/.stumpwmrc
     (set-prefix-key (kbd "C-;"))
     (define-key *top-map* (kbd "s-Up") "move-focus up")
     (define-key *top-map* (kbd "s-Down") "move-focus down")
     (define-key *top-map* (kbd "s-Left") "move-focus left")
     (define-key *top-map* (kbd "s-Right") "move-focus right")

     (define-key *top-map* (kbd "s-M-Up") "pull-hidden-next")
     (define-key *top-map* (kbd "s-M-Down") "pull-hidden-previous")
     (define-key *top-map* (kbd "s-M-Left") "prev")
     (define-key *top-map* (kbd "s-M-Right") "next")

     (define-key *top-map* (kbd "C-s-Up") "move-window up")
     (define-key *top-map* (kbd "C-s-Down") "move-window down")
     (define-key *top-map* (kbd "C-s-Left") "move-window left")
     (define-key *top-map* (kbd "C-s-Right") "move-window right")

     (define-key *root-map* (kbd "1") "only")
     (define-key *root-map* (kbd "2") "vsplit")
     (define-key *root-map* (kbd "3") "hsplit")
     (define-key *root-map* (kbd "0") "remove-split")
     ;; (kbd "C-d r") - interactive resize
   #+end_src
** Swank Server
   Enable a swank server so that stump can be programmed in an REPL
   (Here, SLIME in emacs), set up as per
   https://www.kaashif.co.uk/2015/06/28/hacking-stumpwm-with-common-lisp/index.html
   #+begin_src lisp :tangle ~/dotfiles/stumpwm/.stumpwmrc
     ;; (require :swank)
     ;; (swank-loader:init)
     ;; (swank:create-server :port 4004
     ;; 		     :style swank:*communication-style*
     ;; 		     :dont-close t)
   #+end_src
