emacs/.emacs.d/init.el

;; (use-package org-ref
;; 	 :ensure t
;; 	 :config
;; 	 (require 'org-id)
;; 	 (require 'org-ref-wos)
;; 	 (require 'org-ref-scopus)
;; 	 (require 'org-ref-pubmed)
;; 	 (require 'doi-utils)
;; 	 (setq bibtex-autokey-year-length 4
;; 	 bibtex-autokey-name-year-separator "-"
;; 	 bibtex-autokey-year-title-separator "-"
;; 	 bibtex-autokey-titleword-separator "-"
;; 	 bibtex-autokey-titlewords 2
;; 	 bibtex-autokey-titlewords-stretch 1
;; 	 bibtex-autokey-titleword-length 5)
;; 	 (setq org-export-with-broken-links t)
;; 	 ;; (setq org-latex-pdf-process
;; 	 ;;       '("pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
;; 	 ;; 	"bibtex %b"
;; 	 ;; 	"makeindex %b"
;; 	 ;; 	"pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
;; 	 ;; 	"pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"))
;; 	 (setq  org-latex-pdf-process
;; 	'("latexmk -shell-escape -bibtex -pdf %f"))
;; 	 (setq org-ref-completion-library 'org-ref-ivy-cite))

(use-package markdown-mode
  :defer t)

(use-package polymode
  :ensure t)

(use-package poly-R
  :ensure t)

(use-package poly-markdown
  :ensure t)

(use-package poly-org
  :ensure t)

;; (use-package ledger-mode
;;   :defer t)

(use-package eval-in-repl
  :ensure t
  :init
  (require 'eval-in-repl-ielm)
  (define-key emacs-lisp-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
  ;; for *scratch*
  (define-key lisp-interaction-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
  ;; for M-x info
  (define-key Info-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
  ;;; Geiser support (for Racket and Guile Scheme)
  ;; When using this, turn off racket-mode and scheme supports
  ;; (require 'geiser) ; if not done elsewhere
  (add-hook 'geiser-mode-hook
       	     '(lambda ()
       		(local-set-key (kbd "<C-return>") 'eir-eval-in-geiser)))

  ;; (require 'scheme)    ; if not done elsewhere
  ;; (require 'cmuscheme) ; if not done elsewhere
  ;; (require 'eval-in-repl-scheme)
  ;; (add-hook 'scheme-mode-hook
  ;; 		 '(lambda ()
  ;; 		    (local-set-key (kbd "<C-return>") 'eir-eval-in-scheme)))

  ;; shell support
  (require 'eval-in-repl-shell)
  (add-hook 'sh-mode-hook
	    '(lambda()
	       (local-set-key (kbd "C-<return>") 'eir-eval-in-shell))))

;; (setq load-path (cons "/usr/local/share/mdk" load-path))
;; (autoload 'mixal-mode "mixal-mode" t)
;; (add-to-list 'auto-mode-alist '("\\.mixal\\'" . mixal-mode))
;; (autoload 'mixvm "mixvm" "mixvm/gud interaction" t)

(use-package j-mode
  :ensure t
  :init
  (local-set-key (kbd "C-c !") 'j-console)
  (local-set-key (kbd "C-<return>") 'j-console-execute-line)
  (custom-set-faces
   '(j-verb-face ((t (:foreground "Red"))))
   '(j-adverb-face ((t (:foreground "Green"))))
   '(j-conjunction-face ((t (:foreground "Blue"))))
   '(j-other-face ((t (:foreground "Black"))))))
